_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_2 (InputLayer)         (None, 870, 870, 3)       0
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 870, 870, 64)      1792
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 870, 870, 64)      36928
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 435, 435, 64)      0
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 435, 435, 128)     73856
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 435, 435, 128)     147584
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 217, 217, 128)     0
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 217, 217, 256)     295168
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 217, 217, 256)     590080
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 217, 217, 256)     590080
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 108, 108, 256)     0
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 108, 108, 512)     1180160
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 108, 108, 512)     2359808
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 108, 108, 512)     2359808
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 54, 54, 512)       0
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 54, 54, 512)       2359808
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 54, 54, 512)       2359808
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 54, 54, 512)       2359808
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 27, 27, 512)       0
=================================================================
Total params: 14,714,688.0
Trainable params: 14,714,688.0
Non-trainable params: 0.0
_________________________________________________________________


PIL.Image.BICUBIC